app/Http/Controllers/User/CryptoController.php

    public function crypto(Request $request, $category_slug = '')
    {
        $main_category = MainCategory::where('major_category_id', '=', '16')->pluck('id')->toArray();

        $cities = Crypto::where('city', '!=', 'null')->pluck('city', 'city')->toArray();
        $states = Crypto::where('area', '!=', 'null')->pluck('area', 'area')->toArray();
        $cuisins = Crypto::where('cusine_name', '!=', 'null')->pluck('cusine_name', 'cusine_name')->toArray();

        $result_array = $this->search_crypto($request, $category_slug);

        $all_cryptos = $result_array['all_cryptos'];
        $total_count = $result_array['total_count'];
        $crypto_category = $result_array['crypto_category'];
        $feature_cryptos = $result_array['feature_crypto'];
        $popular_cryptos = $result_array['popular_crypto'];
        $nextPageUrl = $result_array['nextPageUrl'];
        $justJoin = $all_cryptos->take($request->get('limit', 10))->sortByDesc('created_at');

        $main_category = MainCategory::where('major_category_id', '=', '16')->get();
        $banner = SliderImage::where('major_category_id', 16)->get();
        $major_category = MajorCategory::find(16);
        $major_category->load(['searchLinksTop', 'searchLinksBottom', 'statistics', 'bannerLinksTop', 'bannerLinksRight', 'bannerLinksBottom', 'bannerLinksLeft']);

        $categories = MainCategory::where('major_category_id', 16)->withCount('crypto')->get();
        $hot_trends = News::orderBy('created_at', 'desc')->limit(3)->get();
        $influencer_reviews = InfluencerReview::where('status', 1)->limit(3)->get();

        $categoryForSidebar = MainCategory::with('subCategory.crypto')->withCount('crypto')->where('major_category_id', 16)->orderBy('crypto_count', 'DESC')->get();
---
select `id` from `main_categories` where `major_category_id` = '16'
select * from `main_categories` where `major_category_id` = '16'
select * from `slider_images` where `major_category_id` = 16
select * from `major_categories` where `major_categories`.`id` = 16 limit 1
select * from `news` order by `created_at` desc limit 3
select * from `influencer_reviews` where `status` = 1 limit 3
select * from `sub_categories` where `sub_categories`.`main_category_id` in (287)


            return view('user.crypto.crypto-listing', get_defined_vars());
        }
        $dynamic_links = DynamicLink::where('major_category_id', 16)->whereNotIn('slug', ['popular-cryptos', 'trending-cryptos', 'hot-cryptos'])->get();
---
select * from `dynamic_links` where `major_category_id` = 16 and `slug` not in ('popular-cryptos', 'trending-cryptos', 'hot-cryptos')

    public function crypto_detail($slug)
    {
        $crypto = Crypto::with(['subCategory', 'featureImage', 'storyImages', 'mainImages', 'logoImage', 'menuImage', 'mainImage', 'approvedReviews', 'upcomingEvents'])->where('slug', '=', $slug)->active()->first();
---
select * from `main_categories` where `main_categories`.`id` in (287)