app/Http/Controllers/User/FrontUserController.php

    public function newLandingPage()
    {
        $main_categories = MainCategory::all();
        $featured_venue = Venue::with('subCategory', 'city')->where('status', 1)->where('assign_featured', 1)->get();
        $venue_category = Venue::where('status', '=', '1')->select('sub_category_id', DB::raw('count(*) as total'))
            ->groupBy("sub_category_id")
            ->get();

        $featured_event = Events::with('get_subcat', 'city')->where('status', 1)->where('is_featured', 1)->get();
        $event_category = Events::where('status', '=', '1')->select('sub_category_id', DB::raw('count(*) as total'))
            ->groupBy("sub_category_id")
            ->get();

        $concierge_event = Concierge::with('subCategory', 'city')->where('status', 1)->where('featured', 1)->get();
        $concierge_category = Concierge::where('status', '=', '1')->select('sub_category_id', DB::raw('count(*) as total'))
            ->groupBy("sub_category_id")
            ->get();

        $news = News::orderby('id', 'desc')->get();

        $popular_cities = City::where('is_popular', '=', '1')->orderby('id', 'desc')->limit(4)->get();
        $popular_cities_eight = City::where('is_popular', '=', '1')->orderby('id', 'desc')->limit(8)->get();
        $galleries = Gallery::with('subCategory', 'city')->where('active', '=', '1')->orderby('id', 'DESC')->get();
        $home_banners = Banner::where('banner_type', 1)->get();
        $promotional_banners = Banner::where('banner_type', 2)->get();
        $recommendations = ItemRecommendation::where('status', 1)->get();
        $home_trend = HomeTrendBanner::all();
---
select * from `main_categories`
select * from `cities` where `cities`.`id` in (10, 13, 106, 120, 123, 132)
select * from `sub_categories` where `sub_categories`.`id` in (72, 73, 77, 78, 79, 80, 82, 90, 115, 116, 125, 341)
select * from `venues` where `status` = 1 and `assign_featured` = 1
select `sub_category_id`, count(*) as total from `venues` where `status` = '1' group by `sub_category_id`
select * from `cities` where `cities`.`id` in (8, 9, 10, 12, 120, 122, 123, 132)
select * from `events` where `status` = 1 and `is_featured` = 1
select `sub_category_id`, count(*) as total from `events` where `status` = '1' group by `sub_category_id`
select * from `cities` where `cities`.`id` in (10, 127, 129, 131, 132, 135)
select * from `concierges` where `status` = 1 and `featured` = 1
select * from `main_categories` where `main_categories`.`id` in (131, 132, 133, 135)
select `sub_category_id`, count(*) as total from `concierges` where `status` = '1' group by `sub_category_id`
select * from `news` order by `id` desc
select * from `cities` where `is_popular` = '1' order by `id` desc limit 4
select * from `cities` where `is_popular` = '1' order by `id` desc limit 8
select * from `cities` where `cities`.`id` in (8, 9, 10, 106, 120, 133, 134, 138)
select * from `galleries` where `active` = '1' order by `id` desc
select * from `main_categories` where `main_categories`.`id` in (7, 82, 141, 143, 144)
select * from `banners` where `banner_type` = 1
select * from `banners` where `banner_type` = 2
select * from `item_recommendations` where `status` = 1
select * from `home_trend_banners`