app/Http/Controllers/User/UserController.php

    public function signup(Request $request)
    {
        $user_type = $request->user_type;
        $data = OtherImage::where('type', 1)->get();
---
select * from `other_images` where `type` = 1