app/Providers/AppServiceProvider.php

            function ($view) {
            $social = SocialMedia::all();
            $browseCategories = MajorCategory::select(['id', 'name', 'slug'])->with(['mainCategory','mainCategory.subCategory'])->get();
            $fewNews = News::select(['id', 'title', 'slug', 'feature_image'])->latest()->limit(4)->get();
            $fewRecommendations = ItemRecommendation::latest()->limit(4)->get();
            $fewAttractions = Attraction::latest()->limit(4)->get();
---
select * from `social_media`
select * from `sub_categories` where `sub_categories`.`main_category_id` in (7, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 92, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 106, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 150, 151, 152, 153, 157, 158, 160, 161, 162, 163, 164, 165, 166, 167, 168, 169, 174, 175, 176, 178, 179, 180, 181, 183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 214, 215, 216, 217, 218, 219, 220, 221, 222, 223, 224, 225, 226, 227, 228, 229, 230, 231, 232, 233, 234, 235, 236, 237, 238, 239, 240, 241, 242, 243, 244, 245, 246, 247, 248, 249, 250, 251, 252, 253, 254, 255, 256, 257, 258, 259, 260, 261, 262, 263, 264, 265, 266, 267, 268, 269, 270, 271, 272, 273, 274, 275, 276, 277, 278, 279, 280, 281, 282, 283, 284, 285, 286, 287, 288, 289)
select `id`, `name`, `slug` from `major_categories`
select `id`, `title`, `slug`, `feature_image` from `news` order by `created_at` desc limit 4
select * from `item_recommendations` order by `created_at` desc limit 4
select * from `attractions` order by `created_at` desc limit 4